УТ_для_edt/src/AccumulationRegisters/ВыручкаИСебестоимостьПродаж/ВыручкаИСебестоимостьПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыручкаИСебестоимостьПродаж</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручкиБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДопРасходы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДопРасходыБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьЗабалансовая</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьЗабалансоваяРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручкиРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДопРасходыУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДопРасходыРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПостоянныеСНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПостоянныеБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПостоянныеУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПостоянныеРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Трудозатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПеременныеСНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПеременныеБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПеременныеУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПеременныеРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручкиСНДСРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРучнойСкидки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаАвтоматическойСкидки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалютеВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДСВВалютеВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалютеДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДСВВалютеДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникГФУНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникГФУРасчетов</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.СчетФактураПолученныйНалоговыйАгент</types>
      <types>DocumentRef.СчетФактураНалоговыйАгент</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетНеЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗапасов</name>
    <type>
      <types>EnumRef.ТипыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаСебестоимостиТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаПартий</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПартий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.СделкиСКлиентами</types>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНаборов</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНаборов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельностиКонтрагента</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельностиНоменклатуры</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>смартДатаЗакрытияЗаказа</name>
    <comment>#1544 смарт: Ермаков / Для хранения даты закрытия заказа из документа ЗаказКлиента</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>смартСтатусЗаказаКлиента</name>
    <comment>#1544 смарт: Ермаков / Для хранения статуса заказа из документа ЗаказКлиента</comment>
    <type>
      <types>EnumRef.СтатусыЗаказовКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>смартБизнесРегионКлиента</name>
    <comment>#1544 смарт: Ермаков / Для хранения статуса заказа из документа ЗаказКлиента</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/смартASP_ЗаменыПодразделений/смартASP_ЗаменыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартASP_ЗаменыПодразделений</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <resources>
    <name>ЗаменяющееПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ПодразделениеДляЗамены</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовКлиентов</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартСтатусыДокументовРасчетаБонусов/смартСтатусыДокументовРасчетаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыДокументовРасчетаБонусов</name>
  <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗавершен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартASP_УстановкаПараметровОборота/смартASP_УстановкаПараметровОборота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартASP_УстановкаПараметровОборота</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Платные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокГрупп</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокГруппДоступа</name>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>CatalogRef.ГруппыДоступаНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключаемаяНоменклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключаемыеГруппыНоменклатуры</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключаемыеКлиенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/CommonModules/смартASP_ОбщийМодуль/Module.bsl
// Возвращаемое значение:
//  Cтруктура:
//        * Выручка – Число
//        * ВыручкаПоПодразделениямТЗ - Таблица значений (если ТолькоСуммаВаловойПрибыли = Ложь)
//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Функция ASP_ПолучитьДанныеОборотаПоРемонтнымРаботамСКД(Дата, ТолькоСуммаВыручки = Ложь, КурсВал = Неопределено) Экспорт
	СхемаКомпоновкиДанных = Отчеты.ВыручкаИСебестоимостьПродаж.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Для Каждого Стр Из Настройки.Структура Цикл
		Если Строка(Стр.ПоляГруппировки) <> "Подразделение (Иерархия)" Тогда
			Стр.Использование = Ложь;
		КонецЕсли;
	КонецЦикла; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	смартASP_УстановкаПараметровОборота.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.смартASP_УстановкаПараметровОборота КАК смартASP_УстановкаПараметровОборота
		|ГДЕ
		|	смартASP_УстановкаПараметровОборота.Проведен = ИСТИНА
		|	И смартASP_УстановкаПараметровОборота.Дата <= &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	смартASP_УстановкаПараметровОборота.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	смартASP_УстановкаПараметровОборота.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", КонецМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();	
		ДокПарам=Выборка.Ссылка;
		
		НоменклатураВГруппеИзСписка = ДокПарам.СписокГрупп.ВыгрузитьКолонку("Группа");
		ASP_УстановитьОтборСКД("Номенклатура", ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, НоменклатураВГруппеИзСписка, Настройки);
		
		ГруппаДоступаНоменклатурыВГруппеИзСписка = ДокПарам.СписокГруппДоступа.ВыгрузитьКолонку("ГруппаДоступа");
		ASP_УстановитьОтборСКД("Номенклатура.ГруппаДоступа", ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, ГруппаДоступаНоменклатурыВГруппеИзСписка, Настройки);
		
		НоменклатураНеВСписке = ДокПарам.ИсключаемаяНоменклатура.ВыгрузитьКолонку("Номенклатура");
		ASP_УстановитьОтборСКД("Номенклатура", ВидСравненияКомпоновкиДанных.НеВСписке, НоменклатураНеВСписке, Настройки);
		
		НоменклатураНеВГруппе = ДокПарам.ИсключаемыеГруппыНоменклатуры.ВыгрузитьКолонку("ГруппаНоменклатуры");
		ASP_УстановитьОтборСКД("Номенклатура", ВидСравненияКомпоновкиДанных.НеВИерархии, НоменклатураНеВГруппе, Настройки);
		
		ЗаказКлиентаРеализацияКлиентНеВСписке = ДокПарам.ИсключаемыеКлиенты.ВыгрузитьКолонку("Контрагент");
		ASP_УстановитьОтборСКД("ЗаказКлиента.Партнер", ВидСравненияКомпоновкиДанных.НеВСписке, ЗаказКлиентаРеализацияКлиентНеВСписке, Настройки);	
		
		ASP_УстановитьОтборСКД("ЗаказКлиента.ДатаЗакрытия", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, НачалоМесяца(Дата), Настройки);
		ASP_УстановитьОтборСКД("ЗаказКлиента.ДатаЗакрытия", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, Дата, Настройки);
		ASP_УстановитьОтборСКД("ЗаказКлиента.ДатаЗакрытия", ВидСравненияКомпоновкиДанных.Заполнено, '00010101', Настройки);
		ASP_УстановитьОтборСКД("ЗаказКлиента.Статус", ВидСравненияКомпоновкиДанных.Равно, Перечисления.СтатусыЗаказовКлиентов.Закрыт, Настройки);
		
		ASP_УстановитьПараметрСКД("СтрокаПродажиПоЗаказам","Продажи по заказам",Настройки);
		ASP_УстановитьПараметрСКД("СтрокаПродажиБезЗаказов","Продажи без заказов",Настройки);
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПараметрТекущаяДата = МакетКомпоновки.ЗначенияПараметров.Найти("ТекущаяДата");
		ПараметрТекущаяДата.Значение = Дата;
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
		
		ДокументРезультат = Новый ТабличныйДокумент;
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ТЗ = Новый ТаблицаЗначений;
		ПроцессорВывода.УстановитьОбъект(ТЗ);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		СтрокаИтого = ТЗ.Найти(Неопределено, "Подразделение");
		
		Структура = Новый Структура;
		Структура.Вставить("Выручка", СтрокаИтого.Выручка);
		
		Если ТолькоСуммаВыручки Тогда
			Возврат Структура;
		КонецЕсли;
		
		ТЗ.Удалить(СтрокаИтого);
		Структура.Вставить("ВыручкаПоПодразделениямТЗ", ТЗ);
		
		Возврат Структура;  
		
	Иначе 
		
		Сообщить("Не найден документ установки параметров");
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Функция ASP_ПолучитьДанныеОборотаПоРемонтнымРаботам(Дата, ТолькоСуммаВыручки = Ложь, КурсВал = Неопределено, Платные = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	смартASP_УстановкаПараметровОборота.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.смартASP_УстановкаПараметровОборота КАК смартASP_УстановкаПараметровОборота
		|ГДЕ
		|	смартASP_УстановкаПараметровОборота.Проведен
		|	И смартASP_УстановкаПараметровОборота.Дата <= &Дата
		|	И смартASP_УстановкаПараметровОборота.Платные = &Платные
		|
		|СГРУППИРОВАТЬ ПО
		|	смартASP_УстановкаПараметровОборота.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	смартASP_УстановкаПараметровОборота.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Платные", Платные);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();	
		ДокПарам=Выборка.Ссылка;
		
		НоменклатураВГруппеИзСписка = ДокПарам.СписокГрупп.ВыгрузитьКолонку("Группа");
		ГруппаДоступаНоменклатурыВГруппеИзСписка = ДокПарам.СписокГруппДоступа.ВыгрузитьКолонку("ГруппаДоступа");
		НоменклатураНеВСписке = ДокПарам.ИсключаемаяНоменклатура.ВыгрузитьКолонку("Номенклатура");
		НоменклатураНеВГруппе = ДокПарам.ИсключаемыеГруппыНоменклатуры.ВыгрузитьКолонку("ГруппаНоменклатуры");
		ЗаказКлиентаРеализацияКлиентНеВСписке = ДокПарам.ИсключаемыеКлиенты.ВыгрузитьКолонку("Контрагент");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Продажи.Подразделение КАК Подразделение,
			|	СУММА(Продажи.СуммаВыручкиОборот) КАК Выручка
			|ПОМЕСТИТЬ врВыручка
			|ИЗ
			|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
			|			,
			|			,
			|			,
			|			(&НоменклатураВГруппеИзСпискаБулево ИЛИ АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&НоменклатураВГруппеИзСписка))
			|				И (&ГруппаДоступаНоменклатурыВГруппеИзСпискаБулево ИЛИ АналитикаУчетаНоменклатуры.Номенклатура.ГруппаДоступа В ИЕРАРХИИ (&ГруппаДоступаНоменклатурыВГруппеИзСписка))
			|				
			|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура В (&НоменклатураНеВСписке)
			|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ (&НоменклатураНеВГруппе)
			|				
			|				И НЕ ЗаказКлиента.Партнер В (&ЗаказКлиентаРеализацияКлиентНеВСписке)
			|				
			|				И (ЗаказКлиента.ДатаЗакрытия МЕЖДУ &Дата1 И &Дата2)
			|				И ЗаказКлиента.ДатаЗакрытия <> &ПустаяДата
			|				И ЗаказКлиента.Статус = &Статус
			|				И АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)) КАК Продажи
			|
			|СГРУППИРОВАТЬ ПО
			|	Продажи.Подразделение
			|
			|ИМЕЮЩИЕ
			|	СУММА(Продажи.СуммаВыручкиОборот) <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(смартASP_ЗаменыПодразделений.ЗаменяющееПодразделение, врВыручка.Подразделение) КАК Подразделение,
			|	врВыручка.Выручка КАК Выручка
			|ИЗ
			|	врВыручка КАК врВыручка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартASP_ЗаменыПодразделений КАК смартASP_ЗаменыПодразделений
			|		ПО (врВыручка.Подразделение = смартASP_ЗаменыПодразделений.ПодразделениеДляЗамены)";
		
		Запрос.УстановитьПараметр("ГруппаДоступаНоменклатурыВГруппеИзСписка", ГруппаДоступаНоменклатурыВГруппеИзСписка);
		Запрос.УстановитьПараметр("ГруппаДоступаНоменклатурыВГруппеИзСпискаБулево", (ГруппаДоступаНоменклатурыВГруппеИзСписка.Количество() = 0));
		Запрос.УстановитьПараметр("НоменклатураВГруппеИзСписка", НоменклатураВГруппеИзСписка);
		Запрос.УстановитьПараметр("НоменклатураВГруппеИзСпискаБулево", (НоменклатураВГруппеИзСписка.Количество() = 0));
		
		Запрос.УстановитьПараметр("НоменклатураНеВГруппе", НоменклатураНеВГруппе);
		Запрос.УстановитьПараметр("НоменклатураНеВСписке", НоменклатураНеВСписке);
		
		Запрос.УстановитьПараметр("ЗаказКлиентаРеализацияКлиентНеВСписке", ЗаказКлиентаРеализацияКлиентНеВСписке);
		
		Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("Дата2", Дата);
		Запрос.УстановитьПараметр("ПустаяДата", '00010101');
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.Закрыт);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		КурсВал = смартASP_ОбщийМодуль.СреднийКурсЗаМесяц(Дата);
		Для Каждого стр Из ТЗ Цикл
			стр.Выручка = стр.Выручка * КурсВал
		КонецЦикла;
	
		Структура = Новый Структура;
		Структура.Вставить("Выручка", ТЗ.Итог("Выручка"));
		
		Если ТолькоСуммаВыручки Тогда
			Возврат Структура;
		КонецЕсли;
		
		Структура.Вставить("ВыручкаПоПодразделениямТЗ", ТЗ);
		
		Возврат Структура;  
		
	Иначе 
		
		Сообщить("Не найден документ установки параметров");
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Процедура ASP_УстановитьОтборСКД(ИмяПоля, ВидОтбора, Значение, Настройки) Экспорт
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого Стр Из Настройки.Отбор.Элементы Цикл
		Если Стр.ЛевоеЗначение = ПолеОтбора И Стр.ВидСравнения = ВидОтбора Тогда
			Отбор = Стр;
		КонецЕсли;
	КонецЦикла;
	Если Отбор = Неопределено Тогда
		Отбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение  = ПолеОтбора;
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		Отбор.ВидСравнения   = ВидОтбора;
		Отбор.Использование  = Истина;
		Отбор.ПравоеЗначение  = Значение;
	Иначе
		Отбор.Использование  = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Процедура ASP_УстановитьПараметрСКД(ИмяПоля, Значение, Настройки)
	НовыйПараметр = Новый ПараметрКомпоновкиДанных(ИмяПоля);
	Для Каждого Стр Из Настройки.ПараметрыДанных.Элементы Цикл
		Если Стр.Параметр = НовыйПараметр Тогда
			Параметр = Стр;
		КонецЕсли;
	КонецЦикла;
	Если Параметр = Неопределено Тогда
		Параметр = Настройки.ПараметрыДанных.Элементы.Добавить();
		Параметр.Параметр  = НовыйПараметр;
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		Параметр.Использование  = Истина;
		Параметр.Значение  = Значение;
	Иначе
		Параметр.Использование  = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Функция СреднийКурсЗаМесяц(Дата, Валюта=Неопределено) Экспорт
	Если Валюта = Неопределено Тогда
		Валюта = Константы.ВалютаУправленческогоУчета.Получить()
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПроизводственныеКалендари.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ПроизводственныеКалендари КАК ПроизводственныеКалендари
	                      |ГДЕ
	                      |	НЕ ПроизводственныеКалендари.ПометкаУдаления");
	
	тзКалендари = Запрос.Выполнить().Выгрузить();
	
	Если тзКалендари.Количество() = 0 Тогда
		Сообщить("Данные по среднему курсу валюты могут быть некорректные, т.к. не найден ни один производственный календарь !!!");
		Возврат 1
	ИначеЕсли тзКалендари.Количество() > 1 Тогда
		Сообщить("Данные по среднему курсу валюты могут быть некорректные, т.к. не найдено несколько производственных календарей !!!");
	КонецЕсли;
	
	///////////////////
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
	///////////////////
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ врДаты
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &Календарь
		|	И ДанныеПроизводственногоКалендаря.ВидДня В(&ВидДня)
		|	И ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &Дата1 И &Дата2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	врДаты.Дата КАК Дата
		|ИЗ
		|	врДаты КАК врДаты";
	
	ВидДня = Новый Массив;
	ВидДня.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	ВидДня.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	Запрос.УстановитьПараметр("ВидДня", ВидДня);
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Календарь", тзКалендари[0].Ссылка);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Сообщить("Данные по среднему курсу валюты могут быть некорректные, т.к. не заполнен производственный календарь !!!");
		Возврат 1
	КонецЕсли;
		
	///////////////////
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалют.Период КАК Дата,
		|	КурсыВалют.Курс КАК Курс
		|ПОМЕСТИТЬ врВалюта
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Валюта = &Валюта
		|	И КурсыВалют.Период МЕЖДУ &Дата1 И &Дата2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	врВалюта.Дата КАК Дата,
		|	врВалюта.Курс КАК Курс
		|ИЗ
		|	врВалюта КАК врВалюта";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Сообщить("Данные по среднему курсу валюты могут быть некорректные, т.к. нет данных по курсу валюты за период !!!");
		Возврат 1
	КонецЕсли;
	
	///////////////////
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	врДаты.Дата КАК Дата,
		|	врВалюта.Курс КАК Курс
		|ИЗ
		|	врДаты КАК врДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ врВалюта КАК врВалюта
		|		ПО врДаты.Дата = врВалюта.Дата";
	
	
	тз = Запрос.Выполнить().Выгрузить();
	
	Если тз.Количество() = 0 Тогда
		Сообщить("Данные по среднему курсу валюты могут быть некорректные, т.к. не согласованы данные производственного календаря и курсы валют !!!");
		Возврат 1
	КонецЕсли;
	
	Возврат тз.Итог("Курс") / тз.Количество()
КонецФункции

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Процедура ASP_УстановитьПрефиксДокументаПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Источник, СтандартнаяОбработка, Префикс)
КонецПроцедуры

Функция смартПолноправныйПользовательБонусы() Экспорт
//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	Возврат РольДоступна("смартASP_ОсновнаяРоль") ИЛИ Пользователи.ЭтоПолноправныйПользователь();
//--#1288 смарт: Лопато 26.12.2022
КонецФункции

Процедура смартУстановитьТолькоПросмотрЭлементаФормы(ЭлементыФормы, ИмяЭлемента, Значение, МассивИсключений = Неопределено) Экспорт
//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	
	Элемент = ЭлементыФормы.Найти(ИмяЭлемента);
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивИсключений <> Неопределено Тогда
		ЭлементИсключение = МассивИсключений.Найти(ИмяЭлемента);
		Если ЭлементИсключение <> Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") ИЛИ ТипЗнч(Элемент) = Тип("ГруппаФормы") ИЛИ ТипЗнч(Элемент) = Тип("ТаблицаФормы") Тогда
		ИмяСвойстваЭлемента = "ТолькоПросмотр";
		ЗначениеСвойства    = Значение;
	ИначеЕсли ТипЗнч(Элемент) = Тип("КнопкаФормы") И (Элемент.Вид <> ВидКнопкиФормы.КнопкаКоманднойПанели ИЛИ Элемент.Родитель.Имя = "ФормаКоманднаяПанель") Тогда
		ИмяСвойстваЭлемента = "Доступность";
		ЗначениеСвойства    = НЕ Значение;
	Иначе
		Возврат;
	КонецЕсли;

	Если Элемент[ИмяСвойстваЭлемента] <> ЗначениеСвойства Тогда
		Элемент[ИмяСвойстваЭлемента] = ЗначениеСвойства;
	КонецЕсли;
	
//--#1288 смарт: Лопато 26.12.2022
КонецПроцедуры

Процедура смартУстановитьТолькоПросмотрФормыРасчетЗавершен(Форма) Экспорт
//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  

	ЭлементыФормы = Форма.Элементы;
 	ОбъектФормы   = Форма.Объект;
	
	Если ОбъектФормы.смартСтатусРасчетаБонусов = ПредопределенноеЗначение("Перечисление.смартСтатусыДокументовРасчетаБонусов.РасчетЗавершен") Тогда
		
		Если ОбъектФормы.Проведен Тогда
			ТолькоПросмотр = Истина
		Иначе
			ТолькоПросмотр = НЕ ПравоДоступа("Изменение", ОбъектФормы.Ссылка.Метаданные());
		КонецЕсли;
		
		Для Каждого Элемент Из ЭлементыФормы Цикл
			смартУстановитьТолькоПросмотрЭлементаФормы(ЭлементыФормы, Элемент.Имя, ТолькоПросмотр);
		КонецЦикла;
		
	КонецЕсли;                                              
	
//--#1288 смарт: Лопато 26.12.2022
КонецПроцедуры
